### JSON 데이터 다루기 1 : 암호화폐가격

## 암호화폐 사이트 내의 그래프에 포함된 수치데이터를 추출하는 방법
# HTML로 데이터가 안 나올 때에는 네트워크의 headers에 들어가서 확인하기
# preview탭은 headers로 데이터를 요청했을 때 추출되는 데이터의 미리보기 제공
# 차트를 이리저리 움직이면서 네트워크탭에 뜨는 데이터들 중 수치 데이터가 포함될만한 것을 선택하고 preview탭을 통해 확인해보기

import requests
import json # json데이터관련 함수들을 위한 라이브러리
import time # 시간관련 함수 - epoch를 년월일로 변환하기 위한 라이브러리  *기본 모델이라 따로 설치할필요 없음음 

data = requests.get('https://tb.coinone.co.kr/api/v1/chart/olhc/?site=coinoneeth&type=1h&last_time=1610262000000')
#print(data.content) # URL은 언제나 사이트 업데이트되면 달라질 수 있음 *대부분의 코인사이트의 html형식은 비슷함
'''
b'{"success":true,"is_last":false,"data":[{"DT":1609545600000,"Open":"803000","Low":"790000","High":"803200","Close":"794500","Volume":"1986.1411","Adj_Close":"794500"},{"DT":1609549200000,"Open":"794500","Low":"791300","High":"808500","Close":"805900","Volume":"1294.5294","Adj_Close":"805900"},{"DT":1609552800000,"Open":"805900","Low":"805600","High":"809300","Close":"806000","Volume":"666.9234","Adj_Close":"806000"},{"DT":1609556400000,"Open":"806000","Low":"803400","High":"807400","Close":"805000","Volume":"708.8551","Adj_Close":"805000"},{"DT":1609560000000,"Open":"805000","Low":"801600","High":"805400","Close":"804400","Volume":"262.162","Adj_Close":"804400"},{"DT":1609563600000,"Open":"804400","Low":"803500","High":"807200","Close":"804500","Volume":"253.1057","Adj_Close":"804500"},{"DT":1609567200000,"Open":"804500","Low":"803400","High":"817000","Close":"813000","Volume":"998.0198","Adj_Close":"813000"},{"DT":1609570800000,"Open":"813000","Low":"809600","High":"815000","Close":"811900","Volume":"660.3421","Adj_Close":"811900"},{"DT":1609574400000,"Open":"811900","Low":"806000","High":"814600","Close":"811000","Volume":"692.4489","Adj_Close":"811000"},{"DT":1609578000000,"Open":"811000","Low":"800300","High":"811300","Close":"801300","Volume":"866.7313","Adj_Close":"801300"},{"DT":1609581600000,"Open":"801300","Low":"800000","High":"810000","Close":"805000","Volume":"615.8068","Adj_Close":"805000"},{"DT":1609585200000,"Open":"805000","Low":"804200","High":"807400","Close":"806600","Volume":"145.9312","Adj_Close":"806600"},{"DT":1609588800000,"Open":"806600","Low":"804500","High":"828900","Close":"826500","Volume":"4890.5609","Adj_Close":"826500"},{"DT":1609592400000,"Open":"826500","Low":"823700","High":"850000","Close":"843800","Volume":"6632.4985","Adj_Close":"843800"},{"DT":1609596000000,"Open":"843800","Low":"826200","High":"845000","Close":"834700","Volume":"2646.6735","Adj_Close":"834700"},{"DT":1609599600000,"Open":"834700","Low":"834700","High":"845900","Close":"844800","Volume":"1504.8336","Adj_Close":"844800"},{"DT":1609603200000,"Open":"844800","Low":"841500","High":"861200","Close":"860800","Volume":"5118.8513","Adj_Close":"860800"},{"DT":1609606800000,"Open":"860800","Low":"852600","High":"863400","Close":"857000","Volume":"1565.448","Adj_Close":"857000"},{"DT":1609610400000,"Open":"857000","Low":"849900","High":"860500","Close":"855500","Volume":"518.3034","Adj_Close":"855500"},{"DT":1609614000000,"Open":"855500","Low":"852400","High":"863500","Close":"860300","Volume":"563.8756","Adj_Close":"860300"},{"DT":1609617600000,"Open":"860300","Low":"837100","High":"862000","Close":"840200","Volume":"2418.8314","Adj_Close":"840200"},{"DT":1609621200000,"Open":"840200","Low":"835300","High":"854000","Close":"850000","Volume":"1896.6194","Adj_Close":"850000"},{"DT":1609624800000,"Open":"850000","Low":"847700","High":"858300","Close":"855700","Volume":"712.8746","Adj_Close":"855700"},{"DT":1609628400000,"Open":"855700","Low":"847700","High":"862300","Close":"859400","Volume":"1502.1841","Adj_Close":"859400"},{"DT":1609632000000,"Open":"859400","Low":"856000","High":"869000","Close":"867000","Volume":"1416.1121","Adj_Close":"867000"},{"DT":1609635600000,"Open":"867000","Low":"863700","High":"875900","Close":"873700","Volume":"1775.7169","Adj_Close":"873700"},{"DT":1609639200000,"Open":"873700","Low":"869700","High":"876300","Close":"873200","Volume":"1139.9363","Adj_Close":"873200"},{"DT":1609642800000,"Open":"873200","Low":"863100","High":"873500","Close":"864000","Volume":"931.8329","Adj_Close":"864000"},{"DT":1609646400000,"Open":"864000","Low":"862600","High":"871500","Close":"870900","Volume":"868.611","Adj_Close":"870900"},{"DT":1609650000000,"Open":"870900","Low":"869700","High":"889900","Close":"883400","Volume":"3268.3139","Adj_Close":"883400"},{"DT":1609653600000,"Open":"883400","Low":"880500","High":"902000","Close":"900500","Volume":"3949.7873","Adj_Close":"900500"},{"DT":1609657200000,"Open":"900500","Low":"897000","High":"910000","Close":"902900","Volume":"2740.4753","Adj_Close":"902900"},{"DT":1609660800000,"Open":"902900","Low":"892500","High":"922000","Close":"920500","Volume":"2822.9102","Adj_Close":"920500"},{"DT":1609664400000,"Open":"920500","Low":"916000","High":"930800","Close":"921800","Volume":"3456.6248","Adj_Close":"921800"},{"DT":1609668000000,"Open":"921800","Low":"920500","High":"934100","Close":"929700","Volume":"2727.455","Adj_Close":"929700"},{"DT":1609671600000,"Open":"929700","Low":"927300","High":"936500","Close":"935000","Volume":"2195.6303","Adj_Close":"935000"},{"DT":1609675200000,"Open":"935000","Low":"931800","High":"941900","Close":"937000","Volume":"1860.9228","Adj_Close":"937000"},{"DT":1609678800000,"Open":"937000","Low":"937000","High":"1000000","Close":"983800","Volume":"9094.6403","Adj_Close":"983800"},{"DT":1609682400000,"Open":"983800","Low":"973000","High":"1043500","Close":"1025000","Volume":"14839.2388","Adj_Close":"1025000"},{"DT":1609686000000,"Open":"1025000","Low":"984100","High":"1034000","Close":"1031900","Volume":"11822.7117","Adj_Close":"1031900"},{"DT":1609689600000,"Open":"1031900","Low":"1031900","High":"1092900","Close":"1047300","Volume":"12857.1517","Adj_Close":"1047300"},{"DT":1609693200000,"Open":"1047300","Low":"1022000","High":"1074200","Close":"1046800","Volume":"5511.6418","Adj_Close":"1046800"},{"DT":1609696800000,"Open":"1046800","Low":"998800","High":"1053300","Close":"1026500","Volume":"4610.8285","Adj_Close":"1026500"},{"DT":1609700400000,"Open":"1026500","Low":"1008000","High":"1036000","Close":"1036000","Volume":"2908.6033","Adj_Close":"1036000"},{"DT":1609704000000,"Open":"1036000","Low":"1034600","High":"1085000","Close":"1062900","Volume":"3830.863","Adj_Close":"1062900"},{"DT":1609707600000,"Open":"1062900","Low":"1053000","High":"1076900","Close":"1069000","Volume":"2748.5023","Adj_Close":"1069000"},{"DT":1609711200000,"Open":"1069000","Low":"1060500","High":"1123000","Close":"1117300","Volume":"7780.4013","Adj_Close":"1117300"},{"DT":1609714800000,"Open":"1117300","Low":"1090000","High":"1142400","Close":"1114200","Volume":"6835.7075","Adj_Close":"1114200"},{"DT":1609718400000,"Open":"1114200","Low":"1076600","High":"1137400","Close":"1112800","Volume":"10731.9333","Adj_Close":"1112800"},{"DT":1609722000000,"Open":"1112800","Low":"1082200","High":"1113800","Close":"1093000","Volume":"4593.0328","Adj_Close":"1093000"},{"DT":1609725600000,"Open":"1093000","Low":"1088000","High":"1112000","Close":"1106600","Volume":"3443.2466","Adj_Close":"1106600"},{"DT":1609729200000,"Open":"1106600","Low":"1105700","High":"1170200","Close":"1166700","Volume":"6597.6442","Adj_Close":"1166700"},{"DT":1609732800000,"Open":"1166700","Low":"1158900","High":"1186000","Close":"1174800","Volume":"5587.8832","Adj_Close":"1174800"},{"DT":1609736400000,"Open":"1174800","Low":"1162500","High":"1256100","Close":"1246000","Volume":"7476.6207","Adj_Close":"1246000"},{"DT":1609740000000,"Open":"1246000","Low":"1238000","High":"1330000","Close":"1266200","Volume":"11670.6222","Adj_Close":"1266200"},{"DT":1609743600000,"Open":"1266200","Low":"1175000","High":"1284800","Close":"1202600","Volume":"12996.9094","Adj_Close":"1202600"},{"DT":1609747200000,"Open":"1202600","Low":"1121000","High":"1240000","Close":"1168100","Volume":"10747.5466","Adj_Close":"1168100"},{"DT":1609750800000,"Open":"1168100","Low":"1023100","High":"1175800","Close":"1100000","Volume":"15363.1548","Adj_Close":"1100000"},{"DT":1609754400000,"Open":"1100000","Low":"1023000","High":"1127700","Close":"1106000","Volume":"13085.8948","Adj_Close":"1106000"},{"DT":1609758000000,"Open":"1106000","Low":"1073800","High":"1135000","Close":"1131900","Volume":"6791.6503","Adj_Close":"1131900"},{"DT":1609761600000,"Open":"1131900","Low":"1111400","High":"1199500","Close":"1179800","Volume":"9050.854","Adj_Close":"1179800"},{"DT":1609765200000,"Open":"1179800","Low":"1118000","High":"1180100","Close":"1157100","Volume":"6982.1691","Adj_Close":"1157100"},{"DT":1609768800000,"
위와 같이 딕셔너리 자료형과 유사한데 ""를 포함한 데이터는 JSON 자료형임 --> 글자취급됨
'''
## python에서 JSON 데이터형식을 딕셔너리로 바꾸는 법
# json.loads
딕셔너리 = json.loads(data.content)
#print(딕셔너리)

# Json 데이터를 해석할 때에는 브라우저 주소창에 URL 입력해서 get요청한 결과 확인해보기(터미널보다 더 깔끔함)
# 전체선택해서 json파일을 하나 생성한 후 붙여넣고 마우스 우클릭에 format document 누르기 (더 보기 쉬울 것임)

## 복잡한 JSON/딕셔너리에서 정보뽑기 - 중첩 데이터 다루기(리스트나 딕셔너리 안에는 모든 자료형을 집어넣을 수 있음)
# 데이터파일에서 DT는 시간을 의미함
# 데이터가 어디에 속해있는 지 확인 ex) "open" 데이터는 딕셔너리 안의 리스트 안의 디셔너리 안에 있음
print(딕셔너리['data'][0]['Close']) # data를 키로하는 딕셔너리 안의 리스트의 첫번째 데이터를 선택 후 거기 안의 close를 key로 하는 딕셔너리 추출
print(딕셔너리['data'][1]['Close']) 


### JSON 데이터 다루기2: 데이터 출력과 시간
## 여러개의 항에서 같은 데이터를 추출하고 싶을 때 for루프 활용가능
## 'DT' = epoch/UNIX 시간(-10자리) 
# epoch 시간을 년월일시분초로 변환해서 흐르는 시간을 기준으로 루프를 설정할 수 있음
for i in range(200):
    시간 = 딕셔너리['data'][i]['DT']
    글자시간 = time.strftime('%Y-%m-%d %H:%M:%S', time.localtime(시간/1000))
# a = time.strftime('%Y-%m-%d %H:%M:%S', time.localtime(160175600000/1000)) # 실제 에포크타임을 년월일, 시분초로 변환  #10자리가 입력되어야 하기에 1000으로 나눠줌
    print(글자시간) # shift + enter: Python REPL의 창에서 하이라이트한 부분만 시행 가능
    print(딕셔너리['data'][i]['DT']) # 각 epoch에 대한 시간을 알 수 있음

## 과거 가격 수백만개 수집하려면?
# 차트를 움직임에 따라 생겨나는 url에 유의하여 과거 가격을 표현하는 url이 무엇인지 확인하고 이와 관련된 규칙 발견하기
# 과거 가격같은 경우에는 last_time부분이 epoch time을 값으로 갖는데 이에 따라 과거 가격이 분류됨 - 차트 뒤로 갈수록 URL안의 time 숫자도 적어짐 - 숫자 규칙 찾아서 여러번 get 요청하면서 모두 수집
data = requests.get('https://tb.coinone.co.kr/api/v1/chart/olhc/?site=coinoneeth&type=1h&last_time=1610262000000')
data = requests.get('https://tb.coinone.co.kr/api/v1/chart/olhc/?site=coinoneeth&type=1h&last_time=1610242000000')




